{
  "backend/main.mo": "Actor implementing authorization, blob storage, and CRUD operations for users, patients, sessions, and captures.",
  "feature_evidence.json": "Feature evidence report mapping features to source files, components, and test IDs.",
  "frontend-file-summaries.txt": "List of short summaries describing various frontend files and their roles.",
  "frontend/index.css": "Tailwind-based global stylesheet defining color variables and light/dark theme tokens.",
  "frontend/index.html": "Base HTML file mounting the React app and loading the main entry script.",
  "frontend/src/App.tsx": "Sets up the app shell, providers, and all main routes for navigation.",
  "frontend/src/captures/batchCapture.ts": "Controller that coordinates multi-photo batch captures with progress, completion, and error callbacks.",
  "frontend/src/captures/captureWorkflow.ts": "Workflow for triggering captures, generating thumbnails, producing metadata, and saving blobs.",
  "frontend/src/captures/thumbnail.ts": "Functions for generating image thumbnails and converting base64 data into binary formats.",
  "frontend/src/components/AppShell.tsx": "Layout wrapper providing header, navigation, footer, and connection badge, rendering routed content via Outlet.",
  "frontend/src/components/BatchCaptureButton.tsx": "Runs a 5-shot batch capture with progress indicator and disabled state handling.",
  "frontend/src/components/CaptureGrid.tsx": "Displays a grid of capture thumbnails with timestamps and selection handling.",
  "frontend/src/components/ConnectionStatusPanel.tsx": "Shows connection status with icons, badges, and optional reconnect or error alerts.",
  "frontend/src/components/DistanceGuide.tsx": "Simple alert showing recommended 2–4 cm imaging distance.",
  "frontend/src/components/ExportPanel.tsx": "Provides ZIP and PDF export actions for a selected patient session with loading states and toasts.",
  "frontend/src/components/LastCapturesTray.tsx": "Shows up to five recent captures with eye badges and navigation to gallery.",
  "frontend/src/components/LiveControlsBar.tsx": "UI for zoom, LED mode, eye toggle, and capture actions with states for timers and capture.",
  "frontend/src/components/LiveStreamViewer.tsx": "Renders base64 video frames to a canvas with zoom support and live/paused badges.",
  "frontend/src/components/LoginButton.tsx": "Authentication button using Internet Identity with login/logout handling and status display.",
  "frontend/src/components/PatientForm.tsx": "Provides UI for selecting existing patients or creating new ones, including form fields and mutation calls.",
  "frontend/src/components/PermissionGuidance.tsx": "Displays an error alert with retry and demo-mode options when device connection fails.",
  "frontend/src/components/RequirementsHelp.tsx": "Shows browser, hardware, and permission requirements for using the app, plus demo mode info.",
  "frontend/src/components/SessionForm.tsx": "Manages selecting or creating sessions for a given patient, including session type and eye selection.",
  "frontend/src/components/TransportPicker.tsx": "Lets users choose WebSerial, WebUSB, or demo transport modes based on browser support.",
  "frontend/src/export/manifest.ts": "Generates an export manifest containing patient, session, and capture metadata including quality and annotation flags.",
  "frontend/src/export/pdfReport.ts": "Builds an HTML-based printable report summarizing patient, session, and capture details with embedded images.",
  "frontend/src/export/zipExport.ts": "Creates a simple export by downloading a manifest JSON and each capture image individually.",
  "frontend/src/gallery/annotationModel.ts": "Defines data structures for annotations, strokes, labels, and calibration for image captures.",
  "frontend/src/gallery/localPersistence.ts": "Handles localStorage persistence for quality scores, annotations, and calibration data.",
  "frontend/src/hooks/useActor.ts": "Creates and manages a backend actor tied to the user's Internet Identity, invalidating dependent queries when it changes.",
  "frontend/src/hooks/useInternetIdentity.ts": "Provides Internet Identity auth state, login, logout, and identity loading via a React context provider.",
  "frontend/src/hooks/useQueries.ts": "Wraps backend actor calls with React Query hooks for fetching and mutating users, patients, sessions, and captures.",
  "frontend/src/index.css": "Defines Tailwind styles and a medical-themed light/dark color palette with custom component utilities.",
  "frontend/src/main.tsx": "Bootstraps the app with React Query and Internet Identity providers.",
  "frontend/src/mcu/autoReconnect.ts": "Implements automatic reconnection logic with retries, delays, and status callbacks for a MicrocontrollerClient.",
  "frontend/src/mcu/MicrocontrollerClient.ts": "Client wrapper managing microcontroller transport selection, connection state, telemetry, streaming, and command sending.",
  "frontend/src/mcu/protocol.ts": "Defines microcontroller message types, commands, telemetry structures, and JSON encode/decode helpers.",
  "frontend/src/mcu/simulator/demoSimulator.ts": "Simulates a microcontroller by emitting handshake, telemetry, video frames, and photos for demo/testing.",
  "frontend/src/mcu/transports/webSerialTransport.ts": "Implements a Web Serial transport that connects to a serial device, handles streaming text I/O, decodes messages, and manages connection state.",
  "frontend/src/mcu/transports/webUsbTransport.ts": "Implements a WebUSB transport that opens a USB device, continuously reads messages, sends commands, and tracks connection state.",
  "frontend/src/pages/ConnectionPage.tsx": "UI page for choosing a connection method, initiating device connection, handling errors, and navigating to the live camera.",
  "frontend/src/pages/ExportReportsPage.tsx": "Provides patient and session selectors and displays an export panel for generating reports from stored captures.",
  "frontend/src/pages/GalleryPage.tsx": "Displays captures filtered by patient and session, with dialogs for viewing and scoring individual images.",
  "frontend/src/pages/LiveCameraPage.tsx": "Live camera interface supporting streaming, capture workflows, batch capture, and interaction with microcontroller telemetry.",
  "frontend/src/pages/PatientsSessionsPage.tsx": "Allows creating/selecting patients and sessions, updates active session state, and links to the live camera interface.",
  "frontend/src/state/activeSessionStore.tsx": "Provides a React context for managing patient/session IDs, session number, and current eye selection.",
  "frontend/src/state/mcuStore.tsx": "Defines a React context wrapping MicrocontrollerClient, exposing connection state, telemetry, frames, and auto‑reconnect handling.",
  "frontend/src/utils/urlParams.ts": "Utility functions for reading, persisting, and clearing URL and sessionStorage parameters, with hash‑routing support.",
  "frontend/tailwind.config.js": "Tailwind configuration extending colors, animations, and layout settings with plugins for typography, container queries, and animations.",
  "project_state.json": "Metadata describing project goals, architecture, and existing features for the EarScope Pro cross‑platform medical imaging app."
}